[{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Kirsten Korosec","title":"Stocks post worst quarter since 2008 financial crisis","description":"The first quarter of 2020 ended with a whimper — with the Dow Jones Industrial Average, S&P 500 and NASDAQ posting their worst quarter in decades — as the COVID-19 pandemic continues to cause uncertainty and volatility across all major stock market indices. A…","url":"http://techcrunch.com/2020/03/31/stocks-post-worst-quarter-since-2008-financial-crisis/","imageUrl":"https://techcrunch.com/wp-content/uploads/2015/05/bear.jpg?w=649","date":"2020-03-31","content":"The first quarter of 2020 ended with a whimper  with the Dow Jones Industrial Average, S&amp;P 500 and NASDAQ posting their worst quarter in decades as the COVID-19 pandemic continues to cause uncertainty and volatility across all major stock market indices.\r… "},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Catherine Shu","title":"Grab hires Peter Oey as its chief financial officer","description":"Grab announced today that it has hired Peter Oey as its new chief financial officer. Prior to joining Grab, Oey was the chief financial officer at LegalZoom, an online legal services company based near Los Angeles. Before that, he served the same role at Myli…","url":"http://techcrunch.com/2020/04/01/grab-hires-peter-oey-as-its-chief-financial-officer/","imageUrl":"https://techcrunch.com/wp-content/uploads/2020/04/GettyImages-1192338076.jpg?w=600","date":"2020-04-01","content":"Grab announced today that it has hired Peter Oey as its new chief financial officer. Prior to joining Grab, Oey was the chief financial officer at LegalZoom, an online legal services company based near Los Angeles.<br/><br/>Before that, he served the same role at Myl… "},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Megan Rose Dickey","title":"DoorDash will offer financial assistance to delivery workers diagnosed with COVID-19 or quarantined","description":"Food delivery startup DoorDash, which also runs operations for Caviar, has announced its plans to provide financial assistance to delivery workers who are diagnosed with COVID-19 or quarantined. DoorDash workers in the U.S., Australia and Canada are eligible …","url":"http://techcrunch.com/2020/03/17/doordash-covid-19/","imageUrl":"https://techcrunch.com/wp-content/uploads/2019/09/doordash.jpg?w=601","date":"2020-03-17","content":"Food delivery startup DoorDash, which also runs operations for Caviar, has announced its plans to provide financial assistance to delivery workers who are diagnosed with COVID-19 or quarantined.<br/><br/>DoorDash workers in the U.S., Australia and Canada are eligible… "},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Jonathan Shieber","title":"Financial markets may be sliding globally, but interest in stock trading apps soars","description":"The stock markets are having a very rough month, but interest in stock trading apps is skyrocketing, according to data from industry trackers and companies themselves. Across the board from speculative stock trading apps from startups like Robinhood to saving…","url":"http://techcrunch.com/2020/03/25/financial-markets-may-be-sliding-globally-but-interest-in-stock-trading-apps-soars/","imageUrl":"https://techcrunch.com/wp-content/uploads/2019/06/GettyImages-1051659174.jpg?w=752","date":"2020-03-25","content":"The stock markets are having a very rough month, but interest in stock trading apps is skyrocketing, according to data from industry trackers and companies themselves.<br/><br/>Across the board from speculative stock trading apps from startups like Robinhood to savin… "},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Alex Wilhelm","title":"Frank raises $5M more in its quest to get students max financial aid","description":"Frank, a New York-based student-facing startup, has raised $5 million in what the company described as an “interim strategic round” led by Chegg, a public edtech company. According to Frank founder and CEO Charlie Javice, previous investors Aleph and Marc Row…","url":"http://techcrunch.com/2020/04/13/frank-raises-5m-more-in-its-quest-to-get-students-max-financial-aid/","imageUrl":"https://techcrunch.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-13-at-3.16.23-PM.png?w=633","date":"2020-04-13","content":"Frank, a New York-based student-facing startup, has raised $5 million in what the company described as an “interim strategic round” led by Chegg, a public edtech company. According to Frank founder and CEO Charlie Javice, previous investors Aleph and Marc Row… "},{"source":{"id":"techcrunch","name":"TechCrunch"},"author":"Manish Singh","title":"Setu raises $15M to help developers connect with banks to offer Indians ‘sachet-sized’ financial products","description":"India’s push to digital payments in the last three years has seen tens of millions of people get comfortable with exchanging money online for the first time. But most businesses in the country are still offline and relying on traditional ways to engage with t…","url":"http://techcrunch.com/2020/04/15/setu-raises-15m-to-help-developers-connect-with-banks-to-offer-indians-sachet-sized-financial-products/","imageUrl":"https://techcrunch.com/wp-content/uploads/2020/04/GettyImages-142420587.jpg?w=600","date":"2020-04-15","content":"Indias push to digital payments in the last three years has seen tens of millions of people get comfortable with exchanging money online for the first time. But most businesses in the country are still offline and relying on traditional ways to engage with th… "},{"source":{"id":"cnn","name":"CNN"},"author":null,"title":"Financial expert: If you're laid off, ask this question first","description":"Financial expert Ted Jenkin reveals which questions you should ask in the event you are laid off from your job due to the coronavirus pandemic.","url":"https://www.cnn.com/videos/business/2020/03/21/ted-jenkin-finance-coronavirus-newday-vpx.cnn","imageUrl":"https://cdn.cnn.com/cnnnext/dam/assets/200321082200-ted-jenkin-3-21-2020-super-tease.jpg","date":"2020-03-21","content":"Chat with us in Facebook Messenger. Find out what's happening in the world as it unfolds."},{"source":{"id":"the-verge","name":"The Verge"},"author":"Andrew J. Hawkins","title":"Uber wants Congress to include protections for drivers in coronavirus stimulus package","description":"Uber is urging elected leaders in Washington, DC to include financial protections for drivers and delivery workers. It is also calling for legal fixes to allow it to continue to classify drivers as independent contractors while also providing some benefits.","url":"https://www.theverge.com/2020/3/23/21190806/uber-coronavirus-driver-protections-economic-stimulus","imageUrl":"https://cdn.vox-cdn.com/thumbor/t6sIhSKpgQau_Y1JIT7vryrM6n4=/0x254:3543x2109/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19825675/1207939715.jpg.jpg","date":"2020-03-23","content":"Photo by Jakub Porzycki/NurPhoto via Getty Images Uber is urging the White House and congressional leaders to include financial assistance for drivers and delivery workers in the economic stimulus package that is currently under debate. The company is also ad… "},{"source":{"id":"engadget","name":"Engadget"},"author":"Jon Fingas","title":"Apple Card holders can defer April payments, too","description":"Apple Card holders are getting another reprieve in light of the COVID-19 pandemic's economic impact. Apple is emailing customers to let them know that they can defer their April payments without interest if if the outbreak has made it difficult to pay on time…","url":"https://www.engadget.com/2020-04-01-apple-card-april-payment-deferments.html","imageUrl":"https://o.aolcdn.com/images/dims?resize=1200%2C630&crop=1200%2C630%2C0%2C0&quality=80&image_uri=https%3A%2F%2Fs.yimg.com%2Fuu%2Fapi%2Fres%2F1.2%2FHbCwjxuYHOVggbSfNYtwMA--%7EB%2Fdz0xNjAwO2g9MTA2NzthcHBpZD15dGFjaHlvbg--%2Fhttps%3A%2F%2Fo.aolcdn.com%2Fimages%2Fdims%3Fcrop%3D3000%252C2000%252C0%252C0%26quality%3D85%26format%3Djpg%26resize%3D1600%252C1067%26image_uri%3Dhttps%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-images%2F2019-03%2F28edea50-5005-11e9-8cff-3ae401badce9%26client%3Da1acac3e1b3290917d92%26signature%3D86cc4a763e8b93f4f42d47677fc48838dd55b9f5&client=amp-blogside-v2&signature=5c24f2b56af1b6fc1e0eada6b4915a69df33645e","date":"2020-04-01","content":"The offer is in line with efforts by banks and other financial institutions to address the sudden surge of people who are out of work or otherwise taking a monetary hit due to the pandemic. Apple, Goldman Sachs and others are still expecting customers to pay … "},{"source":{"id":"cnn","name":"CNN"},"author":"Carolyn Manno, CNN","title":"After Tokyo 2020 postponement, money has become a real worry for Olympian Gwen Berry","description":"Like many Americans around the country, Gwen Berry is weighing her financial options.","url":"https://edition.cnn.com/2020/04/04/sport/gwen-berry-olympics-coronavirus-usa-spt-intl/index.html","imageUrl":"https://cdn.cnn.com/cnnnext/dam/assets/200402155747-gwen-berry-tease-super-tease.jpg","date":"2020-04-04","content":""},{"source":{"id":"bbc-news","name":"BBC News"},"author":"https://www.facebook.com/bbcnews","title":"Global economy will suffer for 'years to come' says OECD","description":"OECD boss Angel Gurría says the economic shock is already bigger than the financial crisis","url":"https://www.bbc.co.uk/news/business-52000219","imageUrl":"https://ichef.bbci.co.uk/news/1024/branded_news/1444B/production/_111391038_oecd.jpg","date":"2020-03-23","content":"Image copyrightGetty Images<br/><br/>The world will take years to recover from the coronavirus pandemic, the Organisation for Economic Co-operation and Development has warned.<br/><br/>Angel Gurría, OECD secretary general, said the economic shock was already bigger than the … "},{"source":{"id":"the-verge","name":"The Verge"},"author":"Monica Chin","title":"As universities shut their doors, international students are left in limbo","description":"Surprise campus closures are just the beginning of the difficulties international students face. In addition to the stress of moving and saying goodbye to friends, many of these students are scrambling to secure access to things many college students take for…","url":"https://www.theverge.com/2020/3/18/21175420/university-college-closure-coronavirus-covid19-housing-internet-security","imageUrl":"https://cdn.vox-cdn.com/thumbor/YWYHN6omFBDXICFGMqyGMszDwZ8=/0x370:5156x3069/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19813632/1212023591.jpg.jpg","date":"2020-03-18","content":"Photo by Maddie Meyer/Getty Images Students are still unsure how (and where) they’ll finish their semester On March 11th, the University of Southern California sent an email to its students, faculty, and staff. “Students who are leaving campus for Spring Rece… "},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Alan Shearer: ‘Let Premier League players decide the best way to help’","description":"Premier League players will want to play their part in the fight against the financial effects of coronavirus, says Alan Shearer.","url":"https://www.bbc.co.uk/sport/football/52209583","imageUrl":"https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/C363/production/_111691005_shearer.png","date":"2020-04-08","content":"English football has been suspended indefinitely because of the coronavirus outbreak<br/><br/>Not many Premier League players will need to be told to play their part in the fight against the financial effects of coronavirus.<br/><br/>A lot of them are high earners who should… "},{"source":{"id":"bbc-news","name":"BBC News"},"author":null,"title":"Coronavirus: Manchester United's Paul Pogba sets up fundraiser and pledges financial support","description":"Manchester United midfielder Paul Pogba sets up a fundraising page and pledges financial support to Unicef to help children affected by coronavirus.","url":"https://www.bbc.co.uk/sport/football/51898604","imageUrl":"https://ichef.bbci.co.uk/onesport/cps/624/cpsprodpb/E8B8/production/_111267595_gettyimages-1196370169.jpg","date":"2020-03-15","content":"Paul Pogba has set up a fundraiser to \"help fight this war against Covid-19\"<br/><br/>Manchester United midfielder Paul Pogba has set up a fundraising page and pledged financial support to Unicef to help children affected by coronavirus.<br/><br/>After turning 27 on Sunday, … "}]